Tekla Open API Reference for Tekla Structures 2025
RebarLeg.Origin Property
 Gets the origin of the leg
 Namespace: Tekla.Structures.Model
 Assembly: Tekla.Structures.Model (in Tekla.Structures.Model.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public RebarLeg.OriginEnum Origin { get; }
Public ReadOnly Property Origin As RebarLeg.OriginEnum
	Get
Property Value
Type: RebarLeg.OriginEnum
See Also
Reference
RebarLeg Class
Tekla.Structures.Model Namespace